legacy/predescribedMotion/tutorials/RFGTumble2D/combiRun/0.orig/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
// Temperature [K]
// Isothermal air at 20°C (293.15 K), 1 atm.
// No heat transfer modelled — all walls are adiabatic (zeroGradient T).

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 293.15;

boundaryField
{
    frontAndBack    { type empty; }
    master
    {
        type            cyclicAMI;
        value           uniform 0;
    }
    slave
    {
        type            cyclicAMI;
        value           uniform 0;
    }

    // Inlet / outlet: temperature carried in with the flow.
    top
    {
        type            inletOutlet;
        inletValue      uniform 293.15;
        value           uniform 293.15;
    }
    bottom
    {
        type            inletOutlet;
        inletValue      uniform 293.15;
        value           uniform 293.15;
    }

    // Far-field: free temperature exchange.
    sideWalls
    {
        type            inletOutlet;
        inletValue      uniform 293.15;
        value           uniform 293.15;
    }

    // Adiabatic rod walls (no heat flux).
    rod        { type zeroGradient; }

    symmetry        { type symmetry; }
}

// ************************************************************************* //