legacy/predescribedMotion/tutorials/RFGTumble2D/combiRun/0.orig/pointDisplacement
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       pointVectorField;
    object      pointDisplacement;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    frontAndBack
    {
        type            empty;
    }
    master
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    slave
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    top
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    bottom
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    sideWalls
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    rod
    {
        // Motion is driven by sixDoFRigidBodyMotion in dynamicMeshDict
        type            calculated;
        value           uniform (0 0 0);
    }
    symmetry
    {
        type            symmetryPlane;
    }
}

// ************************************************************************* //