legacy/predescribedMotion/tutorials/RFGTumble2D/combiRun/system/changeDictionaryDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      changeDictionaryDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

boundary
{
    master
    {
        type            cyclicAMI;
        matchTolerance  0.0001;
        transform       noOrdering;
        neighbourPatch  slave;
    }
    slave
    {
        type            cyclicAMI;
        matchTolerance  0.0001;
        transform       noOrdering;
        neighbourPatch  master;
    }
}

// ************************************************************************* //
